{
  "title": [
    "Joanna Hulek"
  ],
  "subtitle": [
    "Frontend Developer · Speaker · Scrum Master"
  ],
  "subtitle_line_broken": [
    "Frontend Developer", "Scrum Master","Speaker"
  ],
  "summary": [
    "I'm addicted to dance and love being surrounded by plants and flowers. I enjoy creating responsive websites and clear, easy-to-maintain solutions. Collaboration, knowledge sharing, and co-creating teams that plays for one goal are my passions. That's why the Agile mindset resonates so well with my own values"
  ],
  "bio": [
    ["Journey into Coding"],
    ["I discovered my passion for programming, especially object-oriented, as a teenager at school. And I pursued it studying Information Technology and Econometrics at Cracow University of Economics. When I graduated, I wasn't sure whether my knowledge and code quality were sufficient to become a developer, so I tried something else. After several years, during my maternity leave, I started to miss coding, so I dove into mobile app development on Android. Later, my role as a Web Miner at Evidence Lab gave me an opportunity to deeply analyze thousands of websites. It helped me to gain knowledge useful for growing as a frontend developer."],
    ["Agile Mindset"],
    ["Working in various companies and projects gave me lots of perspectives and experiences. I discovered that an agile mindset is very close to my own values. A well-organized and transparent workflow definitely helps people deliver better value, but the key is team building, communication, and cooperation - as the essence of Agile lies not just in optimizing processes but in fostering a culture of collaboration and continuous improvement. That makes better become the best. Thanks to my initiative to implement Scrum in an R&D project, I had the opportunity to better understand how the Scrum framework exactly works and also introduce this approach to my teammates."],
    ["Supporting, Sharing, Speaking"],
    ["Not only code (and agile) is the programmer's life. I find immense fulfillment also in sharing my knowledge, experience, and supporting others in their development. I've spoken at conferences and webinars, wrote essayes, and conducted trainings for my teammates, to share my experiances and knowleadges, . Whether it was through mentoring sessions, training workshops, or performing in a charity musical , I'm driven by a desire to make a positive impact and blending my work with my passions."]
  ]}