{
  "title": [
    "Joanna Hulek"
  ],
  "subtitle": [
    "Frontend Developer & Agile Practitioner"
  ],
  "subtitle_line_broken": [
    "Frontend Developer", "& Agile Practitioner"
  ],
  "summary": [
    "I'm addicted to dance and love being surrounded by plants and flowers. I enjoy creating responsive websites and clear, easy-to-maintain solutions. Collaboration, knowledge sharing, and co-creating teams that plays for one goal are my passions. That's why the Agile mindset resonates so well with my own values"
  ],
  "bio": [
    ["Journey into Coding"],
    ["I discovered my passion for programming, especially object oriented, as a teenager at school. And I pursued it studying Information Technology and Econometrics on Cracow University of Economics. When I graduated, I wasn't sure whether my knowledge and code quality were sufficient to become a developer, so I tried  something else. After several years, during my maternity leave, I dove into mobile app development on Android and even founded my own startup. Later, my role as a Web Miner at Evidence Lab gives me an opportunity to deeply analyze thousands of websites. It helped me into get a knowledge useful to grow as a frontend developer."],
    ["Agile Mindset"],
    ["Through working in various companies and projects, gave me lots of perspectives and experiences. I discovered that agile mindset is very close to my own values - as the essence of Agile lies not just in optimizing processes but in fostering a culture of collaboration and continuous improvement. Well organized and transparent workflow definitly helps people to deliver the better value, but the key is team building, comunication and cooperation - that makes better solutions the best. Thanks to my initiative to implement Scrum in an R&D project I had opportunity to better understand how scrum exactly works and introduce this approach to my teammates."],
    ["Supporting, Sharing, Speaking"],
    ["Not only code (and agile) is the programmer's life. I find immense fulfillment also in sharing my knowledge, experiance and supporting others in their development. Whether it's through public speaking engagements at conferences and webinars, through hands-on training sessions for my team, or performing in a charity musical - I am driven by a commitment to making a positive impact in the community by combined my work with my passions."]
    ]}